iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/гисЗначенияПоказателейОбъектов/гисЗначенияПоказателейОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гисЗначенияПоказателейОбъектов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗначениеЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСправочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.гисОбъектыКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гисПоказатели</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/гисПоказателиТипы/гисПоказателиТипы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гисПоказателиТипы</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
  <enumValues>
    <name>Справочник</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисПоказатели/гисПоказатели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гисПоказатели</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.гисПоказателиТипы</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочникИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникВладелецЗначений</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗнаков</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.гисПоказателиПериодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СлоиКарты</name>
    <attributes>
      <name>СлойКарты</name>
      <type>
        <types>CatalogRef.гисСлоиКарты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсплывающееСообщение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонРасчета</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Детализация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦветаПоказателей</name>
    <attributes>
      <name>КлючСтрокиСлоиКарты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОт</name>
      <type>
        <types>Boolean</types>
        <types>Number</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/InformationRegisters/гисЗначенияПоказателейОбъектов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает значение объекта по показателю на дату.
//
// Параметры:
//  Объект		 - СправочникСсылка.гисОбъектыКарты - объект, значение которого нужно получить;
//  Показатель	 - СправочникСсылка.гисПоказатели - показатель, значение которого нужно получить;
//  Дата		 - Дата - дата, на которую нужно получить значение.
// 
// Возвращаемое значение:
//   - Число - если значение показателя числовое;
//   - Булево - если значение показателя типа булево;
//   - СправочникСсылка - если значение показателя - справочник.
//
Функция ПолучитьЗначениеОбъектаПоПоказателю(Объект, Показатель, Дата) Экспорт
	Если Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Булево Тогда
		Значение = Ложь;
		НазваниеРеквизита = "ЗначениеБулево";
	ИначеЕсли Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Число Тогда
		Значение = 0;
		НазваниеРеквизита = "ЗначениеЧисло";
	ИначеЕсли Показатель.ТипЗначения = Перечисления.гисПоказателиТипы.Справочник Тогда
		Значение = Справочники[Показатель.СправочникИмя].ПустаяСсылка();
		НазваниеРеквизита = "ЗначениеСправочник";
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ * ИЗ РегистрСведений.гисЗначенияПоказателейОбъектов.СрезПоследних(&Дата, Объект = &Объект И Показатель = &Показатель И Период >= &ДатаНачала)");
	
	СтрокиСлоев = Показатель.СлоиКарты.НайтиСтроки(Новый Структура("СлойКарты", Объект.Слой));
	Если СтрокиСлоев.Количество() > 0 Тогда
		СтрокаСлоев = СтрокиСлоев[0];
		Если ЗначениеЗаполнено(СтрокаСлоев.ШаблонРасчета) Тогда
			Запрос.Текст = СтрокаСлоев.ШаблонРасчета;
			НазваниеРеквизита = "Значение";
		КонецЕсли;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Показатель", Показатель);
	
	ДатаНачала = Справочники.гисПоказатели.ПолучитьНачалоПериода(Показатель, Дата);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗначениеНеПустое = Выборка[НазваниеРеквизита];
			Если ТипЗнч(Значение) <> ТипЗнч(ЗначениеНеПустое) Тогда
				ОписаниеТипа = Справочники.гисПоказатели.ПолучитьТипЗначения(Показатель.ТипЗначения, Показатель.СправочникИмя);
				ЗначениеНеПустое = ОписаниеТипа.ПривестиЗначение(ЗначениеНеПустое);
			КонецЕсли;
			
			Значение = ЗначениеНеПустое;
		КонецЕсли;
	Исключение
		ВызватьИсключение "Ошибка при расчете значения показателя " + Показатель + " для объекта " + Объект + " на дату " + Дата;
	КонецПопытки;
	
	Возврат Значение;
КонецФункции

#КонецОбласти
